In [28]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [29]:
df["Category"] = ["A","B","C","A","B"]

In [30]:
df

      Name  Age Category
0    Alice   25        A
1      Bob   30        B
2  Charlie   35        C
3    David   40        A
4      Eve   45        B

In [33]:
import numpy as np
# mapでも変換可能
df["Category"].map({"A":1,"B":2,"C":3}).astype(np.int8)

0    1
1    2
2    3
3    1
4    2
Name: Category, dtype: int8

In [21]:
df.dtypes

Name        object
Age          int64
Category    object
dtype: object

In [22]:
# カテゴリ型→数値型
# 機械学習モデルに投入する際などに、カテゴリ型のデータを数値型に変換する必要がある

# カテゴリ型に変換してから、数値型に変換する
df["Category"] = df["Category"].astype("category").cat.codes

In [23]:
df

      Name  Age  Category
0    Alice   25         0
1      Bob   30         1
2  Charlie   35         2
3    David   40         0
4      Eve   45         1